{
  "scraper": "design",
  "scraped_at": "2025-08-27T15:35:56.526294",
  "count": 38,
  "data": [
    {
      "name": "Baja SAE",
      "slug": "baja-sae",
      "org_type": "design_team",
      "description": "The University of Waterloo Baja SAE team designs and builds an off-road, single seat vehicle to compete annually at SAE sanctioned Baja competitions. The competition events include endurance, acceleration, top speed and manoeuvrability events. Each team is provided with a 10 horsepower engine that cannot be modified; the rest of the vehicle is designed and built from scratch every year, such as the frame, suspension, powertrain and controls.",
      "social_media": {
        "website": [
          "https://waterloobaja.ca"
        ],
        "email": [
          "uwaterloobaja@gmail.com"
        ]
      },
      "tags": [
        "Engineering",
        "Robotics",
        "Outdoors"
      ],
      "is_active": true,
      "last_active": "Current",
      "source_url": "https://uwaterloo.ca/sedra-student-design-centre/directory-teams",
      "last_scraped_at": "2025-08-27 15:11:39.065677"
    },
    {
      "name": "Battery Workforce Challenge",
      "slug": "battery-workforce-challenge",
      "org_type": "design_team",
      "description": "We are a student-run design team focused on designing, building, and integrating an electric vehicle (EV) battery pack into a Ram ProMaster cargo van. Our team is part of the Battery Workforce Challenge (BWC), an Advanced Vehicle Technology Competition (AVTC) series sponsored by the U.S. Department of Energy and Stellantis and managed by Argonne National Laboratory.",
      "social_media": {
        "website": [
          "https://uwevolution.com"
        ],
        "email": [
          "bwc.uwlc@hotmail.com"
        ],
        "instagram": [
          "https://instagram.com/battchallengeuwlc"
        ]
      },
      "tags": [
        "Hardware",
        "Sustainability"
      ],
      "is_active": true,
      "last_active": "Current",
      "source_url": "https://uwaterloo.ca/sedra-student-design-centre/directory-teams",
      "last_scraped_at": "2025-08-27 15:11:39.302497"
    },
    {
      "name": "Concrete Canoe Team",
      "slug": "concrete-canoe-team",
      "org_type": "design_team",
      "description": "The UW Concrete Canoe Team designs, builds, and races a canoe made entirely of reinforced concrete for the annual Canadian National Concrete Canoe Competition (CNCCC). The competition rules change each year to incorporate new challenges and we are generally evaluated on our concrete mix design, hull design/modelling, structural design/analysis, construction & project management, sustainability including GHG accounting, impact evaluation & mitigation, equity diversity and inclusion (EDI) initiatives, paddling race performance, and spirit. We also dabble in programming, website/UX design, graphic design and much more. Students from all backgrounds and programs are encouraged to join! No experience is required and no matter your interests there is something for everyone.",
      "social_media": {
        "website": [
          "https://waterlooconcretecanoe.ca"
        ],
        "email": [
          "concretecanoe@uwaterloo.ca"
        ]
      },
      "tags": [
        "Engineering",
        "Sustainability"
      ],
      "is_active": true,
      "last_active": "Current",
      "source_url": "https://uwaterloo.ca/sedra-student-design-centre/directory-teams",
      "last_scraped_at": "2025-08-27 15:11:39.419679"
    },
    {
      "name": "Concrete Toboggan Team",
      "slug": "concrete-toboggan-team",
      "org_type": "design_team",
      "description": "The Waterloo Toboggan Team (est. 1984) designs and builds a 5-person sled with steering, braking, suspension, and concrete skis, then races it against other universities in Canada's oldest and largest student engineering competition; the Great Northern Concrete Toboggan Race (GNCTR). 400+ students from 20+ schools gather annually for three days at GNCTR to showcase their themed toboggans to judges, pass safety inspections, and hit speeds of over 70 km/h.",
      "social_media": {
        "website": [
          "https://waterlootoboggan.ca/"
        ],
        "email": [
          "toboggan@uwaterloo.ca"
        ]
      },
      "tags": [
        "Engineering",
        "Recreation"
      ],
      "is_active": true,
      "last_active": "Current",
      "source_url": "https://uwaterloo.ca/sedra-student-design-centre/directory-teams",
      "last_scraped_at": "2025-08-27 15:11:39.270241"
    },
    {
      "name": "Electrium Mobility",
      "slug": "electrium-mobility",
      "org_type": "design_team",
      "description": "Electrium Mobility is a student design team at the University of Waterloo dedicated to building sustainable, portable, and electric transportation solutions in the form of electric skateboards, bikes, scooters, and other portable electric mobility options. The team currently holds internal competitions where multiple sub-teams test and compete with the personal electric vehicles they have built. Our focus is being a beginner-friendly team and providing students a hands-on experience while minimizing the learning curve. Students who are looking for an opportunity to rapidly prototype, make mistakes, and make a meaningful contribution towards building a more sustainable future can benefit from joining our team!",
      "social_media": {
        "website": [
          "https://electriummobility.com/"
        ],
        "email": [
          "electriummobility@gmail.com"
        ],
        "instagram": [
          "https://www.instagram.com/electriummobility"
        ]
      },
      "tags": [
        "Sustainability",
        "Hardware"
      ],
      "is_active": true,
      "last_active": "Current",
      "source_url": "https://uwaterloo.ca/sedra-student-design-centre/directory-teams",
      "last_scraped_at": "2025-08-27 15:11:39.444638"
    },
    {
      "name": "Engineers Without Borders",
      "slug": "engineers-without-borders",
      "org_type": "design_team",
      "description": "Engineers Without Borders (EWB) is a non-governmental organization founded by Waterloo graduates that work towards ending poverty within the world. With 34 professional and student chapters across Canada, we work to support initiatives in Ghana, Malawi, Uganda, Zambia, and many more countries. The University of Waterloo EWB chapter is committed to developing leaders with the skills and perspective necessary to create sustainable social change in local, national, and international communities, especially focusing on Indigenous communities within Canada. The UW chapter of EWB is also working towards a globalization of engineering curriculum and encourage growth within the fair trade market.",
      "social_media": {
        "facebook": [
          "https://www.facebook.com/ewbuw/"
        ]
      },
      "tags": [
        "Sustainability",
        "Leadership",
        "Advocacy"
      ],
      "is_active": true,
      "last_active": "Current",
      "source_url": "https://uwaterloo.ca/sedra-student-design-centre/directory-teams",
      "last_scraped_at": "2025-08-27 15:11:39.233963"
    },
    {
      "name": "F_rmlab",
      "slug": "f-rmlab",
      "org_type": "design_team",
      "description": "F_RMlab is a design and research collective engaged in advanced computational design tools in support of new paradigms of public space where dynamic interaction, social responsiveness, regenerative materials and systemic resilience are integral goals in building. F_RMlab promotes computational discourse and media at the University of Waterloo School of Architecture through the process of collaborative design and experimentation in real-world projects. Since 2012, we have frequently exhibited at design festivals with installation work, utilizing computational design tools and alternative methods of digital fabrication to explore the intersection of technology and art as well as push the possibilities of interactive architecture.",
      "social_media": {
        "website": [
          "https://frmlab.ca"
        ],
        "email": [
          "f_rmlab@outlook.com"
        ]
      },
      "tags": [
        "Architecture",
        "Design",
        "Technology"
      ],
      "is_active": true,
      "last_active": "Current",
      "source_url": "https://uwaterloo.ca/sedra-student-design-centre/directory-teams",
      "last_scraped_at": "2025-08-27 15:11:39.107007"
    },
    {
      "name": "Formula Nano",
      "slug": "formula-nano",
      "org_type": "design_team",
      "description": "Formula Nano is dedicated to designing, building, and racing molecular machines at the nanoscale. We're working towards competing in the next international Nanocar Race where teams compete to race single molecules using a specialized scanning tunneling microscope. Our team members focus on the synthesis and characterization of molecular components in the lab or on simulating and optimizing the nanocar using computational models, exploring two important pillars of nanotechnology engineering.",
      "social_media": {
        "website": [
          "http://uwformulanano.ca"
        ],
        "email": [
          "uwformulanano@gmail.com"
        ],
        "linkedin": [
          "https://www.linkedin.com/company/uwformulanano"
        ]
      },
      "tags": [
        "Science",
        "Engineering",
        "Robotics"
      ],
      "is_active": true,
      "last_active": "Current",
      "source_url": "https://uwaterloo.ca/sedra-student-design-centre/directory-teams",
      "last_scraped_at": "2025-08-27 15:11:39.204534"
    },
    {
      "name": "UW Formula Electric",
      "slug": "uw-formula-electric",
      "org_type": "design_team",
      "description": "University of Waterloo Formula Electric (UWFE, formerly known as Waterloo Formula Electric and UW Formula Motorsports), is a student design team dedicated to designing, building, testing, and competing with a formula-style open-wheel electric racecar each year in the FSAE Michigan and Formula Hybrid + Electric competition series. If you're interested in being a racecar engineer and manufacturing a vehicle from the ground-up each year, consider joining the team!",
      "social_media": {
        "website": [
          "https://www.uwfsae.ca/"
        ],
        "email": [
          "uwformulae@gmail.com"
        ],
        "facebook": [
          "https://www.facebook.com/UWFormula/"
        ],
        "instagram": [
          "https://www.instagram.com/uwaterlooelectric"
        ]
      },
      "tags": [
        "Engineering",
        "Robotics",
        "Sustainability"
      ],
      "is_active": true,
      "last_active": "Current",
      "source_url": "https://uwaterloo.ca/sedra-student-design-centre/directory-teams",
      "last_scraped_at": "2025-08-27 15:11:39.355080"
    },
    {
      "name": "Hacker Fab",
      "slug": "hacker-fab",
      "org_type": "design_team",
      "description": "Waterloo Hacker Fab is establishing Canada’s first open-source microchip fabrication lab, with all equipment engineered from scratch. Our goal is to develop reliable processes to build NMOSFET chips with a 10-micron gate length in a 24-hour turnaround.",
      "social_media": {
        "website": [
          "https://www.waterloofab.com"
        ],
        "email": [
          "waterloohackerfab@gmail.com"
        ]
      },
      "tags": [
        "Hardware",
        "Science"
      ],
      "is_active": true,
      "last_active": "Current",
      "source_url": "https://uwaterloo.ca/sedra-student-design-centre/directory-teams",
      "last_scraped_at": "2025-08-27 15:11:38.900593"
    },
    {
      "name": "Industry 4.0 Team",
      "slug": "industry-4-0-team",
      "org_type": "design_team",
      "description": "The University of Waterloo Industry 4.0 design team is focused on promoting the unique Management Engineering program offered here at the University. Our team designs and organizes an \"industry 4.0\"-theme competition for high school students across the country to participate in and learn about these concepts in a fun and engaging manner. The members of our team get the opportunity to plan and execute a competition from scratch and deal with all the various components that go into such a project, all the while learning more about our field. We also work with a custom scale factory that we model the competition after. This side of the team allows our members to get involved and develop the skills required to build and maintain such a factory.",
      "social_media": {
        "email": [
          "industry4team@uwaterloo.ca"
        ]
      },
      "tags": [
        "Engineering",
        "Education",
        "Competition"
      ],
      "is_active": true,
      "last_active": "Current",
      "source_url": "https://uwaterloo.ca/sedra-student-design-centre/directory-teams",
      "last_scraped_at": "2025-08-27 15:11:39.375960"
    },
    {
      "name": "International Genetically Engineered Machine Team (iGEM)",
      "slug": "international-genetically-engineered-machine-team-igem",
      "org_type": "design_team",
      "description": "The goal of the Waterloo International Genetically Engineered Machine team (iGEM) is to engineer biological processes like electrical and software systems, rewiring naturally-occurring genetic components using principles from synthetic biology. The team competes annually at the iGEM competition, allowing students to explore new and exciting ways to solve real world problems using biological parts.",
      "social_media": {
        "website": [
          "https://igem.uwaterloo.ca"
        ],
        "email": [
          "igemwaterloo@uwaterloo.ca"
        ]
      },
      "tags": [
        "Science",
        "Engineering"
      ],
      "is_active": true,
      "last_active": "Current",
      "source_url": "https://uwaterloo.ca/sedra-student-design-centre/directory-teams",
      "last_scraped_at": "2025-08-27 15:11:39.038648"
    },
    {
      "name": "MedTechResolve",
      "slug": "medtechresolve",
      "org_type": "design_team",
      "description": "MedTechResolve aims to automate the process of diagnosis, treatment, and prognosis, both inside and outside of the emergency room (ER). Our current project focuses on shortening the waiting time as well as reducing excessive reliance on human assistance during triage in the ER. The team participates in the John Hopkins Healthcare Design Competition annually.",
      "social_media": {
        "website": [
          "https://uwmedtechresolve.ca"
        ],
        "email": [
          "uwmedtechresolve@outlook.com"
        ]
      },
      "tags": [
        "Healthcare",
        "AI",
        "Robotics"
      ],
      "is_active": true,
      "last_active": "Current",
      "source_url": "https://uwaterloo.ca/sedra-student-design-centre/directory-teams",
      "last_scraped_at": "2025-08-27 15:11:38.873229"
    },
    {
      "name": "Midnight Sun Solar Car Team",
      "slug": "midnight-sun-solar-car-team",
      "org_type": "design_team",
      "description": "The Midnight Sun Solar Rayce Car Team designs, manufactures, and races solar-electric cars capable of travelling on public highways. Our mission is to educate the public and promote innovation in sustainable energy technologies. Midnight Sun’s membership spans from the undergraduate level all the way to university alumni and come from all of UW’s six faculties. Our diverse team offers challenging work in the mechanical, electrical, and business disciplines, with project cycles spanning multiple years. The team competes in the American Solar Challenge and the World Solar Challenge.",
      "social_media": {
        "website": [
          "http://www.uwmidsun.com/"
        ],
        "email": [
          "solar@uwmidsun.com"
        ],
        "facebook": [
          "https://www.facebook.com/uwmidsun"
        ]
      },
      "tags": [
        "Sustainability",
        "Engineering",
        "Outdoors"
      ],
      "is_active": true,
      "last_active": "Current",
      "source_url": "https://uwaterloo.ca/sedra-student-design-centre/directory-teams",
      "last_scraped_at": "2025-08-27 15:11:39.287770"
    },
    {
      "name": "Robotics Team (UWRT)",
      "slug": "robotics-team-uwrt",
      "org_type": "design_team",
      "description": "The uWaterloo Robotics Team focuses on the constantly evolving field of autonomous vehicles and the team frequently takes on multiple projects and competitions each year. These competitions have included the NASA Sample Return Robot Challenge, the International Autonomous Robot Racing Challenge, the Intelligent Ground Vehicle Competition, the University Rover Challenge and a UW mini-sumo robotics competition as an introductory project for junior team members.",
      "social_media": {
        "website": [
          "https://www.uwaterloorobotics.com"
        ],
        "email": [
          "uwaterloorobotics@gmail.com"
        ]
      },
      "tags": [
        "Robotics",
        "Hardware",
        "AI"
      ],
      "is_active": true,
      "last_active": "Current",
      "source_url": "https://uwaterloo.ca/sedra-student-design-centre/directory-teams",
      "last_scraped_at": "2025-08-27 15:11:39.085052"
    },
    {
      "name": "Steel Bridge Design Team",
      "slug": "steel-bridge-design-team",
      "org_type": "design_team",
      "description": "The Steel Bridge Design Team's focus is on designing, fabricating, and competing with a modular steel bridge at an annual international competition. The design portion requires creativity and a quick mind, with upper year team members helping to teach technical skills along the way. The fabrication team uses welders, mills, saws, and grinders to fabricate each module of the bridge. Team members will use real design codes, handbooks, and the computer software that they can expect to find in any design office.",
      "social_media": {
        "website": [
          "http://www.uwaterloosteelbridge.com"
        ],
        "email": [
          "UWSteelBridgeDesign@gmail.com"
        ]
      },
      "tags": [
        "Engineering",
        "Design",
        "Competition"
      ],
      "is_active": true,
      "last_active": "Current",
      "source_url": "https://uwaterloo.ca/sedra-student-design-centre/directory-teams",
      "last_scraped_at": "2025-08-27 15:11:39.138780"
    },
    {
      "name": "The Waterloo Alternative Protein Project",
      "slug": "the-waterloo-alternative-protein-project",
      "org_type": "design_team",
      "description": "The Waterloo Alternative Protein Project is the first chapter of the Good Food Institute’s Alt. Protein Project in Canada. The project aims to create a sustainable and secure food system through research, entrepreneurship, and innovation. The Waterloo chapter is working towards initiating Alt. Protein related research projects, encouraging students to create start-ups in the Alt. Protein industry, and making partnerships with existing start-ups. This chapter is also hoping to improve the taste, texture, and appearance of new protein products through lab testing in future terms.",
      "social_media": {
        "website": [
          "http://www.altprotein.ca"
        ],
        "email": [
          "altprouw@gmail.com"
        ]
      },
      "tags": [
        "Sustainability",
        "Entrepreneurship"
      ],
      "is_active": true,
      "last_active": "Current",
      "source_url": "https://uwaterloo.ca/sedra-student-design-centre/directory-teams",
      "last_scraped_at": "2025-08-27 15:11:39.398307"
    },
    {
      "name": "UWAFT",
      "slug": "uwaft",
      "org_type": "design_team",
      "description": "At UWAFT (University of Waterloo Alternative Fuel Team) we continuously break new ground in the field of sustainable transportation through innovation, technology, and student engagement. Through active community involvement we spread the message of sustainability locally, nationally, and internationally.",
      "social_media": {
        "website": [
          "https://www.uwaft.ca/"
        ],
        "email": [
          "uwaft.ecocar@gmail.com"
        ]
      },
      "tags": [
        "Sustainability",
        "Engineering"
      ],
      "is_active": true,
      "last_active": "Current",
      "source_url": "https://uwaterloo.ca/sedra-student-design-centre/directory-teams",
      "last_scraped_at": "2025-08-27 15:11:39.127402"
    },
    {
      "name": "UWATERLOO IISE",
      "slug": "uwaterloo-iise",
      "org_type": "design_team",
      "description": "IISE is the world's largest professional society dedicated to the support of the industrial & systems engineering profession and individuals involved with improving quality and productivity. The UWaterloo IISE Chapter was formed in 2012 and has since gone on to provide countless opportunities and services for students to reach their full potential.",
      "social_media": {
        "website": [
          "https://uwaterlooiise.ca/"
        ],
        "email": [
          "info@uwaterlooiise.ca"
        ]
      },
      "tags": [
        "Academic",
        "Leadership"
      ],
      "is_active": true,
      "last_active": "Current",
      "source_url": "https://uwaterloo.ca/sedra-student-design-centre/directory-teams",
      "last_scraped_at": "2025-08-27 15:11:39.082845"
    },
    {
      "name": "UW ASIC",
      "slug": "uw-asic",
      "org_type": "design_team",
      "description": "UWASIC is a student design team at the University of Waterloo dedicated to exploring the world of ASIC and FPGA development. Our mission is to bridge the gap between academic learning and industry practice, preparing the next generation of chip designers.",
      "social_media": {
        "website": [
          "https://uwasic.com/"
        ],
        "email": [
          "uwasic.waterloo@gmail.com"
        ]
      },
      "tags": [
        "Hardware",
        "Academic"
      ],
      "is_active": true,
      "last_active": "Current",
      "source_url": "https://uwaterloo.ca/sedra-student-design-centre/directory-teams",
      "last_scraped_at": "2025-08-27 15:11:39.169387"
    },
    {
      "name": "UW Biomechatronics Design Team",
      "slug": "uw-biomechatronics-design-team",
      "org_type": "design_team",
      "description": "The UW Biomechatronics Design Team (aka Biotron) is a design team at the University of Waterloo that designs and builds biomechanical devices to solve biomedical problems. We are a group of science and engineering students that create solutions to emerging and existing problems in the biomedical field. Our team is comprised of 4 sub-teams: EMG Fabric, e-NABLE, Spine Bio Sticker, and Tetra. Each team is working on creating solutions to different biomedical issues.",
      "social_media": {
        "website": [
          "https://uwbiotron.netlify.app"
        ],
        "email": [
          "biotron@uwaterloo.ca"
        ]
      },
      "tags": [
        "Science",
        "Robotics",
        "Hardware"
      ],
      "is_active": true,
      "last_active": "Current",
      "source_url": "https://uwaterloo.ca/sedra-student-design-centre/directory-teams",
      "last_scraped_at": "2025-08-27 15:11:39.196555"
    },
    {
      "name": "UW Blueprint",
      "slug": "uw-blueprint",
      "org_type": "design_team",
      "description": "UW Blueprint strives to make technology accessible and useful for those who create communities and promote public welfare. We are a group of students dedicated to building and promoting technology for social good. We partner with non-profits to provide technology services such as web applications, mobile applications and analysis tools—free of charge. Blueprint was founded in 2012 at UC Berkeley. The University of Waterloo is Blueprint's first chapter outside of UC Berkeley.",
      "social_media": {
        "website": [
          "https://uwblueprint.org"
        ],
        "email": [
          "info@uwblueprint.org"
        ],
        "facebook": [
          "https://www.facebook.com/uwblueprint/"
        ]
      },
      "tags": [
        "Software",
        "Volunteer",
        "Advocacy"
      ],
      "is_active": true,
      "last_active": "Current",
      "source_url": "https://uwaterloo.ca/sedra-student-design-centre/directory-teams",
      "last_scraped_at": "2025-08-27 15:11:39.155550"
    },
    {
      "name": "UW NanoRobotics Group",
      "slug": "uw-nanorobotics-group",
      "org_type": "design_team",
      "description": "UWNRG is a student-run design team aiming to solve modern problems with nano solutions. Over the past few years, UWNRG has gone from competing in IEEE’s International ICRA competition to establishing its very own research group. Our current project involves designing and fabricating a FET sensor with graphene oxide gel for bio-sensing applications.",
      "social_media": {
        "website": [
          "http://www.uwnrg.ca"
        ],
        "email": [
          "uwnrg.controls@gmail.com"
        ]
      },
      "tags": [
        "Robotics",
        "Science"
      ],
      "is_active": true,
      "last_active": "Current",
      "source_url": "https://uwaterloo.ca/sedra-student-design-centre/directory-teams",
      "last_scraped_at": "2025-08-27 15:11:38.977080"
    },
    {
      "name": "UW Orbital",
      "slug": "uw-orbital",
      "org_type": "design_team",
      "description": "UW Orbital is a group of determined individuals, of all different skill levels and programs, coming together to build a CubeSat with the goal of competing in the upcoming Canadian Satellite Design Challenge (CSDC). Throughout the design challenge, students will have the chance to learn about electrical, mechanical and firmware engineering, as well as get exposure to the managerial and business side of the space industry. The team hopes to build a launchpad for students to enter the SpaceTech industry by providing technical, hands-on experience and opportunities to develop their professional networks.",
      "social_media": {
        "website": [
          "https://www.uworbital.com/"
        ],
        "email": [
          "uworbital@gmail.com"
        ]
      },
      "tags": [
        "Science",
        "Hardware",
        "Engineering"
      ],
      "is_active": true,
      "last_active": "Current",
      "source_url": "https://uwaterloo.ca/sedra-student-design-centre/directory-teams",
      "last_scraped_at": "2025-08-27 15:11:39.130815"
    },
    {
      "name": "UW REACT - FIRST Robotics",
      "slug": "uw-react-first-robotics",
      "org_type": "design_team",
      "description": "UW REACT keeps the spirit of the FIRST Robotics Competition alive after high school by building fully autonomous FRC robots. We design, manufacture, program, and compete against other FRC teams, but without using a human driver. We also host the worlds largest Robot in 3 Days event every year, where two teams of students build FRC robots in just 72 hours, completing the entire FRC challenge 40 days before bag and tag.",
      "social_media": {
        "website": [
          "http://uwreact.ca"
        ],
        "email": [
          "hello@uwreact.ca"
        ],
        "facebook": [
          "https://www.facebook.com/teamuwreact/"
        ]
      },
      "tags": [
        "Robotics",
        "Hardware"
      ],
      "is_active": true,
      "last_active": "Current",
      "source_url": "https://uwaterloo.ca/sedra-student-design-centre/directory-teams",
      "last_scraped_at": "2025-08-27 15:11:39.174320"
    },
    {
      "name": "UW Reality Labs",
      "slug": "uw-reality-labs",
      "org_type": "design_team",
      "description": "UW Reality Labs is a student design team at the University of Waterloo that specializes in XR (extended reality) and spatial computing. Our team offers students hands-on experience with cutting-edge VR (virtual reality) and AR (augmented reality) technologies, as well as experimental spatial experiences. We encourage highly interested students from all engineering disciplines to join us!",
      "social_media": {
        "website": [
          "https://github.com/uwrealitylabs"
        ],
        "email": [
          "uwrealitylabs@gmail.com"
        ],
        "instagram": [
          "https://www.instagram.com/uwrealitylabs/"
        ],
        "linkedin": [
          "https://www.linkedin.com/company/uwrealitylabs/"
        ]
      },
      "tags": [
        "Software",
        "AI",
        "Hardware"
      ],
      "is_active": true,
      "last_active": "Current",
      "source_url": "https://uwaterloo.ca/sedra-student-design-centre/directory-teams",
      "last_scraped_at": "2025-08-27 15:11:39.119394"
    },
    {
      "name": "UWSiO",
      "slug": "uwsio",
      "org_type": "design_team",
      "description": "UWSiO (University of Waterloo Silicon Integrated Optics) is a dynamic group of students focused on advancing and revolutionizing data storage through the use of silica systems. In an age of rapidly growing and often wasteful data production, we aim to develop solutions that are more efficient, durable, and scalable. Our mission extends beyond advancing storage technology; we are committed to making it widely accessible. Leveraging silica-based storage, we strive for sustainable and reliable data management on a large scale. Our initiative also emphasizes educational outreach, offering learning experiences for those interested in this innovative field. We integrate technological developments with practical academic exposure, fostering a comprehensive understanding of this field.",
      "social_media": {
        "email": [
          "uwsio.team@gmail.com"
        ],
        "linkedin": [
          "https://ca.linkedin.com/company/uw-sio"
        ]
      },
      "tags": [
        "Science",
        "Sustainability",
        "Academic"
      ],
      "is_active": true,
      "last_active": "Current",
      "source_url": "https://uwaterloo.ca/sedra-student-design-centre/directory-teams",
      "last_scraped_at": "2025-08-27 15:11:39.549063"
    },
    {
      "name": "UW Vex U Robotics Team",
      "slug": "uw-vex-u-robotics-team",
      "org_type": "design_team",
      "description": "The UW VEX U Robotics design team designs, builds and programs robots to compete in the international VEX U Robotics competition. Every season a new challenge is announced in which over 300 teams spend the year constructing, optimising and competing against each other. These robots are capable of precise object manipulation, visual object detection, unaided autonomous motion and navigation, driver-assisted remote operation, and much more. UW VEX U strives to push the boundaries of robotics by implementing various manufacturing techniques, advanced software control algorithms and sensor integrations combining all engineering disciplines. Our team welcomes new students with and without prior competitive robotics experience!",
      "social_media": {
        "website": [
          "http://www.uwvexu.com"
        ],
        "email": [
          "uwvexu@gmail.com"
        ]
      },
      "tags": [
        "Robotics",
        "Software",
        "Hardware"
      ],
      "is_active": true,
      "last_active": "Current",
      "source_url": "https://uwaterloo.ca/sedra-student-design-centre/directory-teams",
      "last_scraped_at": "2025-08-27 15:11:39.397343"
    },
    {
      "name": "WAT ARROW",
      "slug": "wat-arrow",
      "org_type": "design_team",
      "description": "WatArrow is a new design team at the University of Waterloo that focuses on the design of small airplanes to compete in the SAE Aero Design competition. We design, build, test, and compete with our electric competition aircraft. Everything that our team produces is in-house. We produce our own designs, perform our own machining, and perform our own wind tunnel testing. We will be competing at SAE Aero Design East in 2024 and are currently ramping up operations.",
      "social_media": {
        "website": [
          "https://watarrow.com"
        ],
        "email": [
          "waterlooarrow@gmail.com"
        ]
      },
      "tags": [
        "Engineering",
        "Robotics",
        "Design"
      ],
      "is_active": true,
      "last_active": "Current",
      "source_url": "https://uwaterloo.ca/sedra-student-design-centre/directory-teams",
      "last_scraped_at": "2025-08-27 15:11:39.019390"
    },
    {
      "name": "Wat Street",
      "slug": "wat-street",
      "org_type": "design_team",
      "description": "Wat Street is a student-run Design Team at the University of Waterloo that strives to provide students with a comprehensive education in the fields of financial investment strategies and algorithm development. The team's primary goal is to create a space where students can learn the fundamentals of quantitative analysis and how to apply them in real-world situations. We will participate in trading competitions such as Optiver's ReadyTraderGo and partner with trading firms to develop algorithms for a variety of markets.",
      "social_media": {
        "website": [
          "https://linktr.ee/watstreet"
        ],
        "email": [
          "watstreetwaterloo@gmail.com"
        ],
        "linkedin": [
          "https://www.linkedin.com/company/wat-street"
        ]
      },
      "tags": [
        "Finance",
        "Software"
      ],
      "is_active": true,
      "last_active": "Current",
      "source_url": "https://uwaterloo.ca/sedra-student-design-centre/directory-teams",
      "last_scraped_at": "2025-08-27 15:11:39.184859"
    },
    {
      "name": "Warrior Home",
      "slug": "warrior-home",
      "org_type": "design_team",
      "description": "The Warrior Home Design Team is a multidisciplinary student design team at the University of Waterloo working towards implementing a high-performance, sustainable, and net-zero energy building in the affordable housing market. Each year, the team hopes to partner with a community that seeks to improve building design with a focus on sustainability and resilience. In 2020, Warrior Home will be partnering with Ottawa Community Housing. The optimized designs, centred around energy efficiency and best construction practices, are innovative and affordable town homes that are molded around the community's unique needs while minimizing utility bills, as well as reduce the initial price of the homes. In the past, Warrior Home has partnered with Habitat for Humanity Waterloo Region, the Chippewas of Nawash, an indigenous community settled along the Grey Bruce peninsula on the Neyaashiiningmiing reserve, and Habitat for Humanity Grey Bruce. Members of the Warrior Home Design Team have volunteered with Habitat for Humanity Grey Bruce and Habitat for Humanity Waterloo Region to build the homes and bring the designs to life. Each year, Warrior Home enters a design into the US Department of Energy's Solar Decathlon. In 2021, Warrior Home will be competing and showcasing our designs at the National Renewable Energy Laboratory in Golden, Colorado. In 2018, Warrior Home participated in the US Department of Energy's Race to Zero Design Competition. Competing alongside 84 teams, Warrior Home's optimized Habitat for Humanity townhouse placed first in the attached housing category.",
      "social_media": {
        "website": [
          "https://www.warriorhome.ca/"
        ],
        "email": [
          "info@warriorhome.ca"
        ],
        "linkedin": [
          "https://www.linkedin.com/company/warrior-home"
        ]
      },
      "tags": [
        "Sustainability",
        "Volunteer"
      ],
      "is_active": true,
      "last_active": "Current",
      "source_url": "https://uwaterloo.ca/sedra-student-design-centre/directory-teams",
      "last_scraped_at": "2025-08-27 15:11:40.423699"
    },
    {
      "name": "Waterloo Aerial Robotics Group (WARG)",
      "slug": "waterloo-aerial-robotics-group-warg",
      "org_type": "design_team",
      "description": "The Waterloo Aerial Robotics Group provides support to all student-run unmanned aerial vehicle (UAV) projects at Waterloo. These projects have included fixed wing aircraft for the Unmanned Systems Canada Competition and a fire detection quadrotor for a capstone design project. The team also hosts engineering design competitions for upper year students at Waterloo.",
      "social_media": {
        "website": [
          "https://www.uwarg.com/"
        ],
        "email": [
          "uwarg@uwaterloo.ca"
        ]
      },
      "tags": [
        "Robotics",
        "Hardware"
      ],
      "is_active": true,
      "last_active": "Current",
      "source_url": "https://uwaterloo.ca/sedra-student-design-centre/directory-teams",
      "last_scraped_at": "2025-08-27 15:11:39.054061"
    },
    {
      "name": "Waterloo RoboSoccer Team",
      "slug": "waterloo-robosoccer-team",
      "org_type": "design_team",
      "description": "The Waterloo RoboSoccer Team (UWRS) develops autonomous humanoid robots to compete in 4-on-4 soccer matches at the annual RoboCup competition. In collaboration with UW’s RoboHub and industry advisors, the team strives to push the boundaries of robotic intelligence and agility through innovative reinforcement learning models, advanced control theory, and cutting-edge electro-mechanical systems.",
      "social_media": {
        "website": [
          "https://uw-robosoccer.github.io"
        ],
        "email": [
          "uwrobosoccer@gmail.com"
        ]
      },
      "tags": [
        "Robotics",
        "AI"
      ],
      "is_active": true,
      "last_active": "Current",
      "source_url": "https://uwaterloo.ca/sedra-student-design-centre/directory-teams",
      "last_scraped_at": "2025-08-27 15:11:39.017283"
    },
    {
      "name": "Waterloo Rocketry Team",
      "slug": "waterloo-rocketry-team",
      "org_type": "design_team",
      "description": "This isn't your uncle's hobby rocketry. Waterloo Rocketry builds sounding rockets that deliver 10 pounds of payload to altitudes of up to 23,000 feet. This team competes annually at the Intercollegiate Rocket Engineering Competition, the world’s biggest competition between undergraduate rocketry teams. The Waterloo Rocketry Team designs and builds their own rocket engine, and performs engine tests on campus. If you’re up to try literal rocket science, give this team a shout!",
      "social_media": {
        "website": [
          "https://www.waterloorocketry.com"
        ],
        "email": [
          "contact@waterloorocketry.com"
        ]
      },
      "tags": [
        "Science",
        "Engineering",
        "Robotics"
      ],
      "is_active": true,
      "last_active": "Current",
      "source_url": "https://uwaterloo.ca/sedra-student-design-centre/directory-teams",
      "last_scraped_at": "2025-08-27 15:11:39.228907"
    },
    {
      "name": "Waterloop",
      "slug": "waterloop",
      "org_type": "design_team",
      "description": "The Waterloop project is the response by a group of dedicated University of Waterloo students to the SpaceX Hyperloop pod challenge to independently design and build a prototype Hyperloop pod to be tested on a one-mile test track in Hawthorne, California in the summer of 2016.",
      "social_media": {
        "website": [
          "http://www.teamwaterloop.com"
        ],
        "email": [
          "admin@teamwaterloop.ca"
        ]
      },
      "tags": [
        "Engineering",
        "Robotics",
        "Hardware"
      ],
      "is_active": true,
      "last_active": "Current",
      "source_url": "https://uwaterloo.ca/sedra-student-design-centre/directory-teams",
      "last_scraped_at": "2025-08-27 15:11:38.996189"
    },
    {
      "name": "WATOLINK",
      "slug": "watolink",
      "org_type": "design_team",
      "description": "WATOLINK offers students an opportunity to develop applications involving action-classification via EEG signal analysis and inference. Our team is currently laying the groundwork for a project that we will submit to the NeuroTechX Competition in 2022. Later on, we may start to develop our own sensor technology and BCI hardware. The efforts of this team could eventually go towards graduate research and could scale towards longer term projects involving speech rendering to make telepathy and brain-controlled applications involving audio generation and mind-to-AI communication commercially viable.",
      "social_media": {
        "website": [
          "https://www.watolink.ca"
        ],
        "email": [
          "business.watolink@gmail.com"
        ]
      },
      "tags": [
        "AI",
        "Hardware"
      ],
      "is_active": true,
      "last_active": "Current",
      "source_url": "https://uwaterloo.ca/sedra-student-design-centre/directory-teams",
      "last_scraped_at": "2025-08-27 15:11:39.390281"
    },
    {
      "name": "WATonomous",
      "slug": "watonomous",
      "org_type": "design_team",
      "description": "WATonomous is transforming a stock Chevrolet Bolt Electric Vehicle into a fully autonomous vehicle! We are 1 of 8 teams selected to compete in the SAE AutoDrive Challenge annually until the end of the competition in 2020. We have several sponsors supplying us with many of the sensors, software, computing platforms, and the Chevrolet Bolt EV itself, needed to complete this challenge.",
      "social_media": {
        "website": [
          "https://www.watonomous.ca/#/"
        ],
        "email": [
          "info@watonomous.ca"
        ],
        "facebook": [
          "https://www.facebook.com/WATonomous"
        ]
      },
      "tags": [
        "Robotics",
        "Software",
        "AI"
      ],
      "is_active": true,
      "last_active": "Current",
      "source_url": "https://uwaterloo.ca/sedra-student-design-centre/directory-teams",
      "last_scraped_at": "2025-08-27 15:11:39.235138"
    },
    {
      "name": "WAT.ai",
      "slug": "wat-ai",
      "org_type": "design_team",
      "description": "Our goal is to establish an environment to enable the continued growth of AI talent and suitable access to opportunities within the waterloo community. We provide opportunities for undergraduate and graduate students to engage in impactful AI projects through collaboration with companies and internal research.",
      "social_media": {
        "website": [
          "http://watai.ca/"
        ],
        "linkedin": [
          "https://www.linkedin.com/company/wat-ai"
        ]
      },
      "tags": [
        "AI",
        "Software"
      ],
      "is_active": true,
      "last_active": "Current",
      "source_url": "https://uwaterloo.ca/sedra-student-design-centre/directory-teams",
      "last_scraped_at": "2025-08-27 15:11:38.877394"
    }
  ]
}